Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.GetAllDirectContext3DGraphicsSettings
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.GetColor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData)
Returns the override color of this piece of DirectContext3D graphics.
graphicsData:
Data of the piece of DirectContext3D graphics.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.SetColor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData,Autodesk.Revit.DB.Color)
Sets color for a piece of DirectContext3D graphics.
graphicsData:
Data of the piece of DirectContext3D graphics.
color:
Color of the piece of DirectContext3D graphics.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.SetVisibility(System.Boolean)
Visibility of the handle and the associated DirectContext3D graphics.
A value of true means that the graphics are visible.
visibility:
Visibility of the handle and the associated DirectContext3D graphics.
A value of true means that the graphics are visible.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.GetColor
Gets the color of the handle and the associated DirectContext3D graphics.
Returns:
The color.
Since:
2026

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.SetColor(Autodesk.Revit.DB.Color)
Sets the color of the handle and the associated DirectContext3D graphics.
color:
The color to apply.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026